# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'sdkman/tap'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'git'
brew 'mas' # Mac App Store manager
brew 'sdkman-cli'


# Development
brew 'node'
brew 'nvm'
brew 'go'

# Apps
cask 'raycast'
cask 'slack'
cask 'visual-studio-code'
cask 'mac-mouse-fix'
cask 'postman'
cask 'intellij-idea'
cask 'lastpass'
cask 'brave-browser'
cask 'finch'
cask 'bitwarden'

# Fonts
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store
mas 'Magnet', id: 441258766